Repository: vb64/telegram.email.notify
Catalog: docs/*/LC_MESSAGES/messages.po
Languages: ru

source: Remove email from allowlist
ru: Удалить email из белого списка

source: Email '{}' have text-transform call at '{}'
ru: Для email '{}' задано преобразование текста на '{}'

source: Remove text-transform
ru: Убрать преобразование текста

source: Set text-transform
ru: Задать преобразование текста

source: Please enter the web address for HTTP request, that makes transformation of original message text.
ru: Введите веб-адрес для HTTP запросов, который будет делать преобразование исходного текста сообщения.

source: This address can't contain '|' and ';' symbols.
ru: Этот адрес не должен содержать символов '|' и ';'.

source: [There is a HOWTO]({}) for building and deploying such web resource.
ru: [Есть руководство]({}) по созданию и развертыванию такого веб-ресурса.

source: Checking given address '{}'...
ru: Проверка адреса '{}'...

source: This address looks wrong: {}
ru: Похоже, этот адрес неверный: {}

source: Text-transform canceled for source: '{}'
ru: Преобразование текста отменено для источника: '{}'

source: Are you sure to clean the list of email addresses, that can post to '{}'?
ru: Вы действительно хотите очистить список адресов емейл, которым разрешено постить в '{}'?

source: For chat '{}' scheduled tasks: {}
ru: Для чата '{}' запланировано задач: {}

source: Select a scheduled task from the list for edit or Cancel to return to chat manage menu.
ru: Выберите запланированную задачу из списка для редактирования или Отказ для возврата в меню управления чатом.

source: deletion of message
ru: удаление сообщения

source: publication of message
ru: публикация сообщения

source: removal {} from now ({})
ru: удаление через {} ({})

source: For '{}' planned:
ru: Для '{}' запланировано:

source: Message preview
ru: Предпросмотр сообщения

source: Back to scheduled tasks list
ru: Возврат к списку запланированных задач

source: Start now
ru: Запустить сейчас

source: Revoke task
ru: Отменить задачу

source: Select action from menu.
ru: Выберите действие из меню

source: Go to message
ru: Перейти к сообщению

source: Task revoked.
ru: Задача отменена.

source: Are you sure to revoke this task?
ru: Уверены, что нужно отменить эту задачу?

source: Starting the task...
ru: Запускаю задачу...

source: Are you sure to run now this task?
ru: Уверены, что задачу нужно запустить сейчас?

source: Who voted?
ru: Кто голосовал?

source: Voting finished
ru: Голосование окончено

source: You already voted
ru: Вы уже голосовали

source: Poll results unreachable.
ru: Результаты опроса недоступны.

source: Additional votes have been displayed.
ru: Дополнительные голоса отображены.

source: View more results
ru: Показать больше голосов

source: Poll completed.
ru: Опрос завершен.

source: Time to poll finish:
ru: Время до завершения опроса:

source: Total votes: {}
ru: Всего голосов: {}

source: Click on the vote to view Telegram profile of the voter.
ru: Кликните на голос для просмотра профиля Telegram голосовавшего.

source: No votes yet.
ru: Голосов пока нет.

source: Please forward here the contact or message from a user to know how this user participated in the poll.
ru: Перешлите сюда контакт или любое сообщение от пользователя, чтобы узнать как он голосовал в этом опросе.

source: To create and manage your own poll, use /start command.
ru: Для создания и использования ваших собственных опросов используйте команду /start

source: Use /help_inlines command for details how to create a poll from your email message.
ru: Команда /help_inlines расскажет как создавать опросы при помощи email.

source: User '{}' voted: '{}'.
ru: Пользователь '{}' голосовал: '{}'.

source: User '{}' does not participate in this poll.
ru: Пользователь '{}' не участвует в этом опросе.

source: Contact '{}' voted: '{}'.
ru: Контакт '{}' проголосовал: '{}'.

source: Contact '{}' does not participate in this poll.
ru: Контакт '{}' не участвует в этом опросе.

source: Your contact '{}' does not have a known Telegram account.
ru: Ваш контакт '{}' не имеет известного мне аккаунта Telegram.

source: Can't find 'forward from' data in this message.
ru: Не могу найти данные от кого это сообщение было переслано.

source: Buy coins for EmailGateBot project.
ru: Купить монеты EmailGateBot

source: Hi
ru: Привет

source: Choose the payment method that's right for you.
ru: Выберите подходящий вам способ оплаты.

source: If the payment method that you need is not listed, write about it in the
ru: Если нужный вам способ оплаты отсутствует, напишите об этом в

source: bot support group
ru: группе поддержки бота

source: You can write in English or Russian.
ru: Вы можете написать на русском или английском языке.

source: Payment for EmailGateBot
ru: Платеж для EmailGateBot

source: How many EmailGateBot coins do you want to buy?
ru: Сколько монет EmailGateBot вы хотите купить?

source: Continue
ru: Далее

source: Order checkout
ru: Переход к оплате

source: You canceled your purchase.
ru: Вы отменили покупку.

source: Dear
ru: Уважаемый

source: Please, write about the reasons for refusal in the
ru: Пожалуйста, напишите о причине вашего отказа в

source: Thank you for your purchase!
ru: Спасибо за покупку!

source: EmailGateBot coins will be credited to your account shortly.
ru: Монеты EmailGateBot будут начислены на ваш аккаунт в ближайшее время.

source: Donate!
ru: Поддержать проект

source: You can support project development by donating if you like this bot.
ru: Вы можете поддержать развитие проекта деньгами, если вам нравится этот бот.

source: not set
ru: не задан

source: Your current language is '{}'.
ru: Ваш текущий язык '{}'.

source: Select language from the list.
ru: Выберите язык из списка.

source: Language set to '{}'.
ru: Язык установлен в '{}'.

source: Send /start to continue.
ru: Отправьте /start для продолжения.

source: List of registered referrals, UTC times
ru: Список рефералов, время UTC

source: Donating to '{}' project.
ru: Пожертвование проекту '{}'.

source: Thank you for your support to '{}' project!
ru: Спасибо за вашу поддержку проекта '{}'!

source: Your donation {} {} was received.
ru: Ваше пожертвование {} {} получено.

source: Thank you for choosing to donate to the project '{}'.
ru: Спасибо за ваше решение помочь проекту '{}'.

source: May be next time, ok.
ru: Может быть, в другой раз. Хорошо.
