Repository: vb64/telegram.email.notify
Catalog: docs/*/LC_MESSAGES/messages.po
Languages: ru

source: There is incoming mail from '{}' to {}.
ru: Есть входящая почта от '{}' для {}.

source: Enable posting from this address?
ru: Разрешить постинг с этого адреса?

source: Allow once
ru: Разрешить в этот раз

source: Disallow once
ru: Запретить в этот раз

source: Allow permanently
ru: Разрешить навсегда

source: Disable permanently
ru: Запретить навсегда

source: Preview message
ru: Предпросмотр сообщения

source: Message original
ru: Оригинал сообщения

source: Processed early
ru: Обработано ранее

source: {} from now
ru: через {}

source: {}, removal {} from now
ru: {}, удаление через {}

source: Planned to publish:
ru: Планируется опубликовать:

source: Scheduled messages rejected due to limit exceeded: {}
ru: Отклонено запланированых публикаций из-за превышения лимита: {}

source: Scheduled messages rejected due to syntax error:
ru: Отклонены запланированые публикации из-за неверных данных:

source: Message preview from '{}' to '{}'.
ru: Предпросмотр сообщения от '{}' в '{}'.

source: permanent
ru: постоянно

source: Posting from '{}' is enabled{}
ru: Постинг от '{}' разрешен{}

source: Posting from '{}' is disabled{}
ru: Постинг от '{}' запрещен{}

source: {} day(s)
ru: {} дн.

source: {} hour(s)
ru: {} час.

source: {} min.
ru: {} мин.

source: soon
ru: скоро

source: You are reached the daily quota for attachments sent ({} attachments).
ru: Вы достигли дневной квоты отправки вложений в email ({} вложения).

source: Daily quota will be reset after {} hours.
ru: Дневная квота будет сброшена через {} часов.

source: I lost access to the chat with code *{}* and stop writing there.
ru: Я потерял доступ к чату с кодом *{}* и прекращаю постинг туда.

source: Message from '{}' to '{}' ({}).
ru: Сообщение от '{}' в '{}' ({}).

source: Your account received a non-standard payment of {} {}.
ru: Для вашего аккаунта поступил нестандартный платеж: {} {}.

source: Please, forward this message to the bot support group in order to add the required amount of coins according to this payment.
ru: Перешлите это сообщение в группу поддержки бота, чтобы вам было начислено соответствующее количество монет.

source: You have credited coins: {}
ru: Вам начислено монет: {}

source: Your referral bought coins: {}
ru: Ваши рефералы приобрели монет: {}

source: Referral data: {}
ru: Данные реферала: {}

source: To receive the next coin, your referrals must buy coins: {}
ru: Для получения следующей монеты ваши рефералы должны купить монет: {}

source: Now you have coins: {}
ru: У вас на счету монет: {}

source: Admin change
ru: Изменено администратором

source: Purchase
ru: Покупка

source: Payment for chat
ru: Оплата для чата

source: From referral program
ru: Из реферальной программы

source: Referral bonus
ru: Реферальный бонус

source: Ignore post to private chat '{}' from '{}'
ru: Игнорирован пост в приватный канал/группу '{}' от '{}'

source: To allow posting, enable premium mode for this chat, or make this chat public (set username).
ru: Чтобы разрешить постинг, включите премиум режим для чата или сделайте чат публичным (задайте username).

source: this chat
ru: этот чат

source: To publish this file, add the following text on a separate line to the email body:
ru: Для публикации этого файла добавьте следующий текст на отдельной строке в сообщении email:

source: Learn more from the [detailed guide]({}).
ru: Узнайте больше из [подробного описания]({}).

source: Stay tuned at the [news channel]({}) of the bot.
ru: Будьте в курсе всех изменений с [новостным каналом]({}) бота.

source: Ask questions at the bot [support group]({}).
ru: Задавайте вопросы в [группе поддержки]({}).

source: {} command can be used in private chat @{}
ru: команду {} можно использовать в приватном чате @{}

source: Buy internal coins for bot premium functions.
ru: Купить монеты для оплаты премиум функций бота.

source: Buy coins
ru: Купить монеты

source: List of your chats.
ru: Список ваших чатов.

source: Please wait, data are processing.
ru: Подождите, идет обработка данных.

source: /clearkeyboard command can be used by admins in groups.
ru: команду /clearkeyboard могут использовать администраторы в группах.

source: More
ru: Еще

source: User ID {} have coins: {}
ru: User ID {} монет: {}

source: The administrator has credited you with coins: {}
ru: Администратор начислил вам монеты: {}

source: Please send me an emoji to view emoji code.
ru: Пошлите мне значок эмодзи для просмотра его кода.

source: To return to bot menu, use /start command.
ru: Для возврата в меню бота используйте команду /start

source: Emoji codes not found.
ru: Коды эмодзи не обнаружены.

source: You can view the list of chats, where bot was added, by sending /start command in private chat.
ru: Для просмотра списка чатов, куда вы разрешили постить боту, отправьте команду /start в приватный чат с ботом.

source: posting to the channel
ru: постинг в канал

source: scheduled, repeatable, and auto-deleted publications
ru: отложенные, повторяющиеся и автоудаляемые публикации

source: emoji emoticons and text formatting
ru: эмодзи, форматирование и разметка текста

source: how to edit published messages
ru: как редактировать опубликованные сообщения

source: how to attach inline buttons to messages.
ru: как добавить кнопки к сообщениям.

source: how to publish files (video, sticker, voice, etc).
ru: как публиковать файлы (video, sticker, voice и т.д.).

source: word to spammers.
ru: слово для спамеров.

source: Dear unknown spammer!
ru: Дорогой незнакомый спаммер!

source: This bot does not have a SMTP interface and you can only communicate with it via mailbox.
ru: Этот бот не имеет smtp интерфейса и общаться с ним можно только по адресу почтового ящика.

source: This bot is absolutely unsuitable for your purposes.
ru: Бот абсолютно непригоден для твоих целей.

source: Pass by and good luck!
ru: Проходи мимо и удачи!

source: For posting to the channel add the bot as channel administrator, then send to channel the command
ru: Для постинга в канал добавьте бота как администратора канала, и отправьте в канал команду

source: You can change Telegram messages from the bot by sending a reply to that message (with quotation).
ru: Вы можете редактировать сообщения Telegram, опубликованные через бота, послав ответ на такое сообщение (с цитированием).

source: The text in the original Telegram message will be replaced by text from your reply.
ru: Текст из вашего ответа заменит текст исходного сообщения.

source: To use markup in updated message, include special code {} or {} at the separate line of your reply.
ru: Для использования разметки добавьте специальный код {} или {} на отдельной строке вашего ответа.

source: This line don't be included in the updated message.
ru: Эта строка не будет включена в новый тест сообщения.

source: The bot automatically deletes your reply with a new message text if it has the permitting to delete messages in the corresponding chat.
ru: Бот автоматически удалит ваш ответ с новым текстом сообщения, если у него есть полномочия на удаление чужих сообщений в соответствующем чате.

source: If the bot does not have such permission, you will need to delete your answer yourself (if necessary).
ru: Если такого полномочия у него нет, вам будет нужно самому удалить свой ответ (если это необходимо).

source: There are some limitations.
ru: Есть несколько ограничений.

source: - editing does not work for messages published earlier than February 13, 2018 18:00 GMT
ru: - редактирование не работает для сообщений, опубликованных ранее 13 февраля 2018 18:00 по Гринвичу

source: - editing does not work in private chat with the bot
ru: - редактирование не работает в приватном чате с ботом

source: - in groups and supergroups to edit bot messages, a user must add a bot to this group
ru: - в группах и супергруппах редактировать сообщения бота может пользователь, который добавил бота в эту группу

source: - editing works in channels where the mode 'signed messages' is on
ru: - редактирование работает в каналах, где включен режим 'подписывать сообщения'

source: Messages in Telegram, that were sent via a MailGate bot, can contain any combination of inline buttons with emoji icons.
ru: Сообщения в Telegram, которые были отправлены через бот MailGate, могут содержать любую комбинацию встроенных кнопок с иконками эмодзи.

source: If you put special string {} in email text body, the tail of the email after this sign will be interpreted as inline buttons definition.
ru: Если вы поместите в текст письма специальную строку {} остаток письма после этой строки будет интерпретирован как определение встроенных кнопок.

source: Text inside square brackets defines the inline button as the poll option.
ru: Текст внутри квадратных скобок создает встроенную кнопку голосования в опросе.

source: You can put several definitions, separated by spaces, in one row.
ru: Вы можете задать несколько таких определений в одной строке.

source: Yes
ru: Да

source: No
ru: Нет

source: The text of buttons title can contain codes, that displaying as emoji icons.
ru: Текст в заголовке кнопки может содержать коды, отображаемые как значки эмодзи.

source: Complete list of emoji codes can be found [here]({}).
ru: Полный список кодов эмодзи можно [посмотреть тут]({}).

source: By default, the newly created poll will be active for 30 days.
ru: По умолчанию созданный опрос будет активен 30 дней.

source: It is a maximum duration.
ru: Это максимальная продолжительность.

source: You can decrease this value by settings the duration of the poll in minutes at the line with `###buttons` code.
ru: Вы можете уменьшить это значение, указав длительность опроса в минутах в строке с кодом `###buttons`.

source: For example, a 10 minutes poll:
ru: Например, для 10-минутного опроса:

source: If closed square bracket is followed by an open round bracket (with no spaces), then this button definition is interpreted as the url-link button.
ru: Если после закрывающей квадратной скобки сразу (без пробелов) следует открывающая круглая скобка, то такое определение кнопки интерпретируется как кнопка с url-ссылкой.

source: Url address must be put inside round brackets.
ru: Адрес url должен находиться внутри круглых скобок.

source: And all of this can be mixed in any combination.
ru: И все это можно смешивать в произвольных комбинациях.

source: Maybe
ru: Может быть

source: The bot can post scheduled messages.
ru: Бот может отправлять отложенные сообщения.

source: To do this, place a special code on the separate line of your message.
ru: Чтобы это сделать, поместите специальный код в отдельную строку вашего письма.

source: For example:
ru: Например:

source: In this case, the message will be published in Telegram chat in given date and time (UTC time zone used).
ru: В этом случае сообщение будет опубликовано в чате Telegram в указанное время. Время указывается по Гринвичу, не забудьте отнять смещение вашего часового пояса.

source: To publish a message several times at different times, add additional lines with the desired publication time.
ru: Чтобы опубликовать сообщение несколько раз в разное время, добавьте дополнительные строки с нужным временем публикации.

source: To post a message at a specified time and then automatically delete it, add the `stop` tag after the `start` tag.
ru: Чтобы опубликовать сообщение в заданное время, а затем автоматически его удалить, добавьте тег `stop` после тега `start`.

source: Lines with a code will be removed from the published message.
ru: Строки с кодом не будут включены в публикуемое сообщение.

source: You can plan scheduled messages up to 30 days ahead.
ru: Вы можете планировать отложенные сообщения на 30 дней вперед.

source: Each channel/group queue can contain up to 10 scheduled tasks.
ru: Очередь каждого канала/группы может содержать до 10 запланированных задач.

source: The text in the `email message` may *contain* _markup_
ru: Текст в `сообщении email` может *содержать* _разметку_

source: or
ru: или

source: To turn on markup, add text {} or {} at the separate line of your message.
ru: Для включения разметки добавьте код {} или {} на отдельной строке вашего письма.

source: If you attach an image up to 10 MB to the email, then the message in Telegram will be made as a photo posting.
ru: Если прикрепить к письму изображение размером до 10 Мб, то сообщение в Telegram будет оформлено как постинг картинки.

source: The first 1024 bytes of the message text will be used as a photo caption.
ru: Первые 1024 байта текста сообщения будут использованы как описание изображения.

source: Valid extensions are:
ru: Допустимые расширения файла:

source: During the day in this way you can post no more than {} pictures.
ru: За сутки таким способом можно отправить до {} изображений.

source: The limit is reset every day at 00:00 GMT.
ru: Лимит отправленных изображений сбрасывается ежедневно в 00:00 по Гринвичу.

source: Also, you can publish image or any file, that supported by Telegram, in special way.
ru: Кроме того, вы можете публиковать изображения или любые файлы, поддерживаемые Telegram, другим способом.

source: To do this, you need to send file to private chat with bot.
ru: Для этого нужно отправить публикуемый файл в приватный чат бота.

source: The bot will reply you by message, that contain special code.
ru: Бот ответит вам сообщением, которое содержит специальный код.

source: This code can be inserted into email body and desired file will be published.
ru: Это код можно вставить в текст email и желаемый файл будет опубликован.

source: Files, that posted by this way, don't counted for daily quota.
ru: Файлы, публикуемые таким способом, не учитываются в суточной квоте.

source: If you specify a code and attach an image file to email, the attached image file will be used and code will be ignored.
ru: Если вы укажите код в тексте письма и вложите в письмо файл изображения, то будет использован вложенный файл, а код будет проигнорирован.

source: The terms of referral program are [described here]({}).
ru: Условия реферальной программы [описаны здесь]({}).

source: Your referral link
ru: Ваша реферальная ссылка

source: Total referrals: {}
ru: Всего рефералов: {}

source: Coins earned: {}
ru: Заработано монет: {}

source: Referral coins to next charge: {}
ru: Реферальных монет до следующего начисления: {}

source: Back to bot menu
ru: Возврат в меню бота

source: Registrations
ru: Регистрации

source: Registrations notify
ru: Оповещения о регистрациях

source: Purchases
ru: Покупки

source: Purchases notify
ru: Оповещения о покупках

source: Disable registrations notify
ru: Отключить оповещения о регистрациях

source: Notifications about new referrals are off.
ru: Оповещения о новых рефералах отключены.

source: Notifications about new referrals are on.
ru: Оповещения о новых рефералах включены.

source: Select chat for new referrals notify.
ru: Выберите чат для оповешений о новых рефералах.

source: List of referral purchases, UTC times
ru: Список покупок рефералов, время UTC

source: Disable purchases notify
ru: Отключить оповещения о покупках

source: Notifications about referral purchases are off.
ru: Оповещения о покупках рефералах отключены.

source: Notifications about referral purchases are on.
ru: Оповещения о покупках рефералах включены.

source: Select chat for referral purchases notify.
ru: Выберите чат для оповешений о покупках рефералов.

source: First, please open private chat @{} for instructions.
ru: Сначала нужно открыть приватный чат @{} для получения инструкций.

source: The email address for posting to this channel can be found in a private chat with the @{}.
ru: Адрес email для постинга в этот канал можно узнать в приватном чате с @{}.

source: To post to a private channel, you need to enable paid mode for that channel.
ru: Для публикаций email в приватном канале вам нужно включить платный режим для этого канала.

source: This can be done in a private chat with the @{}.
ru: Это можно сделать в приватном чате с @{}.

source: There you can also find the email address for posting to the channel.
ru: Там же можно узнать адрес email для постинга в канал.

source: You can read more about the paid mode here
ru: Больше информации о платном режиме

source: Hi, admin!
ru: Привет, админ!

source: The email address for posting to this group can be found in a private chat with the @{}.
ru: Адрес email для постинга в эту группу можно узнать в приватном чате с @{}.

source: To post to a private group, you need to enable paid mode for that group.
ru: Для публикаций email в приватной группе вам нужно включить платный режим для этой группы.

source: There you can also find the email address for posting to the group.
ru: Там же можно узнать адрес email для постинга в группу.

source: Hi, {}!
ru: Привет, {}!

source: Previous
ru: Предыдущий

source: This chat
ru: Этот чат

source: Next
ru: Следующий

source: Previous page
ru: Предыдущая страница

source: Next page
ru: Следующая страница

source: This bot allows posting from an email box to Telegram chats, where you added this bot.
ru: Этот бот позволяет отправлять сообщения с любого ящика емайл в те чаты Telegram, куда вы добавили этого бота.

source: You can publish all kinds of content (pictures, stickers, voice, etc.) and add buttons to messages.
ru: Можно публиковать все виды контента (картинки, стикеры, голос и т.д) и добавлять к сообщениям кнопки.

source: Messages can be scheduled up to 30 days ahead, repeatable and auto-deleted.
ru: Сообщения могут быть запланированы до 30 дней, повторяться и автоматически удаляться.

source: Published messages can be edited.
ru: Опубликованные сообщения можно редактировать.

source: /start to return to this screen at any time.
ru: /start для возврата к стартовому экрану

source: /language to change the language of this conversation.
ru: /language для смены языка диалога

source: /help for more info.
ru: /help для дополнительной информации

source: your coins: {}
ru: ваши монеты: {}

source: /buycoins for fund your account with EmailGateBot internal coins.
ru: /buycoins для пополнения баланса.

source: /coinslog for view the history of balance changes.
ru: /coinslog для просмотра истории изменений баланса.

source: /referrals for join to the referral program.
ru: /referrals для участия в реферальной программе.

source: For posting to group and supergroup just add the bot as a member.
ru: Для постинга в группу/супергруппу просто добавьте бота как участника.

source: /helpchannel for posting to the channel.
ru: /helpchannel для инструкций по постингу в канал.

source: To publish a file, first send the desired file to this chat.
ru: Для публикации файла сначала отправьте нужный файл в этот чат.

source: Select chat from the list for manage and instructions how to post to.
ru: Выберите чат из списка для управления и получения инструкций по постингу в чат.

source: disabled
ru: отключено

source: enabled
ru: включено

source: Each first post from new email needs to be approved by you in this private chat.
ru: Каждый первый пост с нового адреса email нужно будет утвердить в этом приватном чате.

source: All incoming emails are published automatically.
ru: Все входящие email публикуются автоматически.

source: Free mode
ru: Бесплатный режим

source: Enable premium mode
ru: Включить премиум режим

source: Premium mode until {} UTC
ru: Премиум режим до {} UTC

source: Prolongate premium mode
ru: Продлить премиум режим

source: Mail to `{}@{}` and content of your email will be published in '{}'.
ru: Отправьте email на `{}@{}` и содержимое вашего письма будет опубликовано в '{}'.

source: Publication of html links for this chat: {}
ru: Публикация html-ссылок для этого чата: {}

source: Link preview mode for this chat: {}
ru: Режим предпросмотра ссылок для этого чата: {}

source: Publishing email addresses for this chat: {}
ru: Публикация адресов email в чате: {}

source: Another group/channel
ru: Другая группа/канал

source: Regenerate chat code
ru: Пересоздать код чата

source: Show addresses
ru: Показывать адреса

source: Html links
ru: Html-ссылки

source: Link preview
ru: Предпросмотр ссылок

source: Auto posting
ru: Автопостинг

source: Remove from list
ru: Удалить из списка

source: Scheduled: {}
ru: Запланировано: {}

source: Allowlist
ru: Белый список

source: Stoplist
ru: Черный список

source: Are you wish to enable auto posting mode to chat '{}'?
ru: Включить режим автопостинга для чата '{}'?

source: All incoming emails will be published automatically, without any request.
ru: Все входящие email будут публиковаться автоматически, без дополнительных запросов.

source: The bot can extract links from html version of email content and publish them in the Telegram message.
ru: Бот может извлекать ссылки из html версии емейл и публиковать их в сообщении Telegram.

source: Are you wish to extract and publish html links to chat '{}'?
ru: Вы хотите извлекать и публиковать html-ссылки в чате '{}'?

source: Are you wish to enable link preview mode to chat '{}'?
ru: Вы хотите включить режим предпросмотра ссылок для чата '{}'?

source: Failed set premium mode for chat '{}', coins: {}, balance: {}
ru: Ошибка установки премиум режима для чата '{}', монет: {}, баланс: {}

source: Premium mode is set until {} for chat '{}'.
ru: Установлен премиум режим до {} для чата '{}'.

source: Coins spent: {}
ru: Потрачено монет: {}

source: You need to enter an integer number of coins.
ru: Нужно ввести целое число монет.

source: (enter 0 for cancel)
ru: (введите 0 для отказа)

source: You do not have enough coins in your account to pay.
ru: У вас недостаточно монет для оплаты.

source: One coin equals 30 days of service for the '{}' in premium mode.
ru: Одна монета соответствует 30 дням обслуживания '{}' в премиум режиме.

source: How many coins do you want to use?
ru: Сколько монет вы хотите использовать?

source: First, you need to top up your balance.
ru: Вам нужно пополнить ваш баланс.

source: {} left chat '{}'.
ru: {} покинул чат '{}'.

source: Are you sure to remove '{}' from list?
ru: Вы действительно хотите удалить '{}' из списка?

source: {} will exit this group/channel.
ru: {} выйдет из этой группы/канала.

source: New code for posting to '{}' is '{}'.
ru: Новый код для постинга в '{}' : '{}'.

source: Are you sure to regenerate code for posting to '{}'?
ru: Вы действительно хотите пересоздать код для постинга в '{}'?

source: Are you wish to enable show addresses mode to chat '{}'?
ru: Включить режим публикации адресов отправителей email для чата '{}'?

source: Select action or email from menu.
ru: Выберите действие или email из меню.

source: Allowlist was cleared for '{}'.
ru: Белый список для '{}' очищен.

source: Stoplist was cleared for '{}'.
ru: Черный список для '{}' очищен.

source: Clear allowlist
ru: Очистить белый список

source: Clear stoplist
ru: Очистить черный список

source: Back to chat manage
ru: Вернуться к управлению чатом

source: Mailbox '{}' was removed from stoplist of the '{}'.
ru: Адрес '{}' удален из черного списка для '{}'.

source: There is no email addresses, who bannned in '{}'.
ru: Нет адресов емейл, которым запрещено постить в '{}'.

source: Editing item of the stoplist.
ru: Редактирование элемента черного списка.

source: Select action for email '{}'
ru: Выберите действие для email '{}'

source: Cancel
ru: Отказ

source: Remove email from stoplist
ru: Удалить email из черного списка

source: Are you sure to clean the list of email addresses, that are banned in '{}'?
ru: Вы действительно хотите очистить список адресов емейл, которым запрещено постить в '{}'?

source: Mailbox '{}' was removed from allowlist of the '{}'.
ru: Адрес '{}' удален из белого списка для '{}'.

source: There is no email addresses, who can post to '{}'.
ru: Нет адресов емейл, которым разрешено постить в '{}'.

source: Editing item of the allowlist.
ru: Редактирование элемента белого списка.
