# -*- coding: utf-8 -*-

source = """
Академия Отдыха сделал публикацию в группе « РЫБАЛКА в Одессе и Одесской области ».
Академия Отдыха 18 марта в 9:59   Форелевый марафон. Видео 37 побед из 109. Турнир по ловле форели спиннингом с берега на кубок Рестпа...   Нравится Комментарий    


Facebook
"""

broken = """
Академия Отдыха сделал публикацию в группе « РЫБАЛКА в Одессе и Одесской области ».
Академия Отдыха 18 марта в 9:59   Форелевый марафон. Видео 37 побед из 109. Турнир по ловле форели спиннингом с берега на кубок Рестпа...   Нравится

Комментарий    


Facebook
"""

result = """
Академия Отдыха сделал публикацию в группе « РЫБАЛКА в Одессе и Одесской области ».
Академия Отдыха 18 марта в 9:59   Форелевый марафон. Видео 37 побед из 109. Турнир по ловле форели спиннингом с берега на кубок Рестпа...   """
